// Задача 66: 
// Задайте значения M и N. Напишите программу, 
// которая найдёт сумму натуральных элементов в промежутке от M до N.


// Console.Write("Input M: ");
// int M = Convert.ToInt32(Console.ReadLine());
// Console.Write("Input N: ");
// int N = Convert.ToInt32(Console.ReadLine());

// int SumNumbers(int M, int N)

//     {
//         return (N == M) ? M : N + SumNumbers(M, N - 1);
//     }

// Console.WriteLine(SumNumbers(M, N));



// Задача 67: 
// Напишите программу, 
// которая будет принимать на вход число и возвращать сумму его цифр.


// int SumNumber1(int n)

// {
//     return (n/10!=0) ? n%10 + SumNumber1 (n/10):n%10;
// }
// Console.Write("Input n: ");
// int n = Convert.ToInt32(Console.ReadLine());
// Console.WriteLine(SumNumber1(n));

